#ifndef __CONFIG_H
#define __CONFIG_H

/* 全局配置文件 --------------------------------------------------------- */
/* 该文件整合了机器人控制器的大部分基本控制参数，从而便于系统的调整 */
/* 默认情况下，该文件已被 main.h 包含 */


/* 用户自定义部分 ------------------------------------------------------- */


/* 扩展控制部分 --------------------------------------------------------- */



/* 基本控制部分 --------------------------------------------------------- */


/* 核心驱动部分 --------------------------------------------------------- */

#define MOTOR_PWM_DUTY_LIMIT 10000
#define MOTOR_TIM_ENCODER_ARR 60000






#endif